{
  "Version": "001",
  "Year": "2024",
  "Semester": "Spring",
  "project_name": "Analyzing Disaster Trends and Predicting Death Toll",
  "Objective": " \n            The first goal of this project is to analyze and understand disaster event statistics in comparison with world \n            development indicators by country since 2000. The second goal is to build a regression model that uses features \n            from each disaster event and world development indicators to predict the total death toll. This project will help \n            to understand how disasters impact rich and poor countries differently while also providing a methodology to aid \n            in future disaster management and response. The UN underscores the importance of understanding disaster risk through \n            key agendas like the SENDAI Framework for Disaster Risk Reduction (SFDRR).\n            ",
  "Dataset": "\n            Two databases will be used, the Emergency Events Database (EM-DAT) and the World Bank’s World Development Indicators \n            Database. The EM-DAT contains tabular data with 15,573 rows of disaster events around the world from 2000 onward. \n            There are 46 columns in the dataset ranging from disaster type, region, start year and month, latitude and longitude, \n            magnitude, total damage, number affected, and total deaths. The dataset is comprehensive in providing basic \n            information about each disaster event. The World Bank’s World Development Indicators Database contains relevant \n            indicator statistics by country since 2000. These include statistics like GDP per Capita and infant mortality\n            along with other technological and poverty indicators. The plan is to append the World Bank data to the disaster \n            data to place each disaster in the context of the given country’s economic, social, and health conditions. \n            Combining the datasets will allow for more grouping and aggregating and ultimately reveal more complicated patterns\n            with disaster events. The World Bank Data will also add relevant features to predict the target variable of total \n            deaths in a regression model.  \n\n            Dataset 1- Emergency Events Database: Disaster Data since 2000: \n            https://doc.emdat.be/docs/data-structure-and-content/emdat-public-table/\n\n            Dataset 2- World Bank: World Development Indicators since 2000:\n            https://databank.worldbank.org/indicator/NY.GDP.PCAP.CD/1ff4a498/Popular-Indicators#\n            ",
  "Rationale": "\n            The rationale of this project is to provide a complex understanding of the impacts of past disasters around the \n            world and help countries stay prepared for disasters in the future.\n            ",
  "Approach": "\n            I plan on approaching this capstone through several steps.  \n\n            1. Finding data and data loading (Python)\n            2. Data cleaning/wrangling and data analysis (R/Python) \n            3. Mapping and visualizations of analysis (R/Python) \n            4. Build/test models + feature engineering (ML with scikit-learn in Python)\n            5. Produce final predictive results and combine them with historical results\n \n            ",
  "Timeline": "\n            This is a rough timeline for this project:  \n\n            - (1 Weeks) Data Loading\n            - (3 Weeks) Data Processing and Analysis\n            - (2 Weeks) Visualizations and Mapping\n            - (6 Weeks) Modeling + Feature Engineering \n            - (1 Weeks) Combining Results  \n            - (1 Weeks) Writing Up a paper and submission\n            - (1 Weeks) Final Presentation  \n\n            ",
  "Expected Number Students": "\n            The expected number of students is one.  \n            ",
  "Possible Issues": "\n            The challenge will be data wrangling and effectively combining the datasets using dates and locations. \n            More challenges will exist in feature engineering and training an effective model.\n            ",
  "Proposed by": "Samuel Harris",
  "Proposed by email": "samharris@gwu.edu",
  "instructor": "Edwin Lo",
  "instructor_email": "edwinlo@gwu.edu",
  "github_repo": "https://github.com/harrissamuel/24Spr_-S-Harris-_-projectName-.git"
}